Repository: surabhiramamoorthy/tomato_disease_detection
Catalog: tomato_disease_project/translations/*/LC_MESSAGES/messages.po
Languages: hi, kn

source: Tomato Disease Detector
hi: टमाटर रोग पहचानकर्ता
kn: ಟೊಮೇಟೋ ರೋಗ ಪತ್ತೆ ಸಾಧನ

source: Choose Language:
hi: भाषा चुनें:
kn: ಭಾಷೆ ಆಯ್ಕೆಮಾಡಿ:

source: 🌱 Tomato Disease Detector
hi: 🌱 टमाटर रोग पहचानकर्ता
kn: 🌱 ಟೊಮೇಟೋ ರೋಗ ಪತ್ತೆ ಸಾಧನ

source: 📷 Upload Leaf Image:
hi: 📷 पत्ते की छवि अपलोड करें:
kn: 📷 ಎಲೆ ಚಿತ್ರವನ್ನು ಅಪ್ಲೋಡ್ ಮಾಡಿ:

source: e.g. 45
hi: उदा. 45
kn: ಉದಾ. 45

source: 🧪 Soil pH:
hi: 🧪 मिट्टी का पीएच:
kn: 🧪 ಮಣ್ಣಿನ ಪಿಹೆಚ್ ಮೌಲ್ಯ:

source: e.g. 6.5
hi: उदा. 6.5
kn: ಉದಾ. 6.5

source: 🧂 Soil Salinity (dS/m):
hi: 🧂 मिट्टी की लवणता (dS/m):
kn: 🧂 ಮಣ್ಣಿನ ಲವಣೀಯತೆ (dS/m):

source: e.g. 1.8
hi: उदा. 1.8
kn: ಉದಾ. 1.8

source: 🔍 Predict
hi: 🔍 पूर्वानुमान लगाएं
kn: 🔍 ಊಹಿಸಿ

source: Prediction Result
hi: पूर्वानुमान परिणाम
kn: ಊಹೆ ಫಲಿತಾಂಶ

source: 🌿 Prediction Result
hi: 🌿 पूर्वानुमान परिणाम
kn: 🌿 ಊಹೆ ಫಲಿತಾಂಶ

source: Disease:
hi: रोग:
kn: ರೋಗ:

source: Uploaded Image
hi: अपलोड की गई छवि
kn: ಅಪ್ಲೋಡ್ ಮಾಡಿದ ಚಿತ್ರ

source: Low Confidence
hi: कम विश्वास
kn: ಕಡಿಮೆ ಆತ್ಮವಿಶ್ವಾಸ

source: Moderate Confidence
hi: मध्यम विश्वास
kn: ಮಧ್ಯಮ ಆತ್ಮವಿಶ್ವಾಸ

source: High Confidence
hi: उच्च विश्वास
kn: ಹೆಚ್ಚು ಆತ್ಮವಿಶ್ವಾಸ

source: 🔍 Prediction Confidence
hi: 🔍 पूर्वानुमान विश्वास
kn: 🔍 ಊಹೆ ಆತ್ಮವಿಶ್ವಾಸ

source: This represents how confident the model is about its prediction.
hi: यह दर्शाता है कि मॉडल अपने पूर्वानुमान के बारे में कितना आत्मविश्वासी है।
kn: ಈದು ಮಾದರಿಯು ತನ್ನ ಊಹೆಯ ಬಗ್ಗೆ ಎಷ್ಟು ಆತ್ಮವಿಶ್ವಾಸ ಹೊಂದಿದೆ ಎಂಬುದನ್ನು ತೋರಿಸುತ್ತದೆ.

source: More About This Disease
hi: इस रोग के बारे में अधिक जानकारी
kn: ಈ ರೋಗದ ಬಗ್ಗೆ ಇನ್ನಷ್ಟು

source: 📊 Sensor Readings
hi: 📊 सेंसर रीडिंग्स
kn: 📊 ಸೆನ್ಸರ್ ಓದುಗಳು

source: Soil Moisture:
hi: मिट्टी की नमी:
kn: ಮಣ್ಣು ತೇವಾಂಶ:

source: Status:
hi: स्थिति:
kn: ಸ್ಥಿತಿ:

source: Recommended:
hi: अनुशंसित:
kn: ಶಿಫಾರಸು ಮಾಡಿದ:

source: Soil pH:
hi: मिट्टी का पीएच:
kn: ಮಣ್ಣಿನ ಪಿಹೆಚ್ ಮೌಲ್ಯ:

source: Soil Salinity:
hi: मिट्टी की लवणता:
kn: ಮಣ್ಣಿನ ಲವಣೀಯತೆ:

source: Description:
hi: विवरण:
kn: ವಿವರಣೆ:

source: Causes:
hi: कारण:
kn: ಕಾರಣಗಳು:

source: Symptoms:
hi: लक्षण:
kn: ಲಕ್ಷಣಗಳು:

source: Cure:
hi: उपचार:
kn: ಚಿಕಿತ್ಸೆ:

source: No additional information available for this disease.
hi: इस रोग के लिए कोई अतिरिक्त जानकारी उपलब्ध नहीं है।
kn: ಈ ರೋಗಕ್ಕೆ ಹೆಚ್ಚಿನ ಮಾಹಿತಿ ಲಭ್ಯವಿಲ್ಲ.
